Саракташ2/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.ОжидаемыеТовары</registerRecords>
  <registerRecords>InformationRegister.ЦеныЗакупки</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыПоСерийнымНомерам</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ТипЦена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Опт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.ТипКоличество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзделия</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипВязки</name>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бирка</name>
      <type>
        <types>CatalogRef.Бирки</types>
      </type>
    </attributes>
    <attributes>
      <name>Вязальщица</name>
      <type>
        <types>CatalogRef.Мастерицы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВязальщицаНаСайте</name>
      <type>
        <types>CatalogRef.Мастерицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>EnumRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаРаботу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Саракташ2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Опт</name>
      <description>Опт</description>
    </items>
  </predefined>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаНаличия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьЭтикетку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОптовыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварИзРеестраНХП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УменьшениеЦеныЗаРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоставщики</name>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОптРазрезыЗначения</name>
    <attributes>
      <name>Разрез</name>
      <type>
        <types>EnumRef.ОптРазрезыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПохожиеРозничныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МастерицыДляПроверки</name>
    <attributes>
      <name>Мастерица</name>
      <type>
        <types>CatalogRef.Мастерицы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ЗаказОснование.Видимость = (ЗначениеЗаполнено(Объект.ЗаказОснование));
	Если Параметры.Ключ.Пустая() Тогда
		Объект.РегистрироватьЦены = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Клиент.РассчитатьСуммуТЧ(Элементы.Товары.ТекущиеДанные,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
		ТекДанные.Цена = 0;
	Иначе
		ЦеныЗакупки = СлужебныйСервер.ЦеныЗакупки(ТекДанные.Номенклатура, Объект.Поставщик, ?(Параметры.Ключ.Пустая(), Неопределено, Объект.Дата));
		ТекЦена = ЦеныЗакупки[ТекДанные.Номенклатура];
		ТекДанные.Цена = ?(ЗначениеЗаполнено(ТекЦена),ТекЦена,0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ВладелецФормы
	Если Объект.Опт = Истина 
		Или (ВладелецФормы <> Неопределено И ВладелецФормы.Родитель.Заголовок = "Поступление товаров (Опт)") Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", Объект.Ссылка); 
		ОткрытьФорму("Документ.ПоступлениеТоваров.Форма.ФормаДокументаОпт", ПараметрыФормы);
	
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если Объект.Поставщик = ПовторноеИспользованиеКлиент.ПоставщикПроизводства() 
		Тогда 
		
		ПараметрыФормы = Новый Структура("Ключ", Объект.Ссылка); 
		ПараметрыФормы.Вставить("ЗначенияЗаполнения"
		, Новый Структура("Склад,Поставщик", Объект.Склад, Объект.Поставщик));
		ОткрытьФорму("Документ.ПоступлениеТоваров.Форма.ФормаДокументаПроизводство", ПараметрыФормы);
	
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПечатьСервер(ТДПечать, МакетПечати, ДополнительныеПараметры)
	
	ТДПечатнаяФормаДокумента = Документы.ПоступлениеТоваров.ПолучитьПечатнуюФорму(Объект, МакетПечати, ДополнительныеПараметры);			
	ТДПечать.Вывести(ТДПечатнаяФормаДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТоварыПечать" Тогда		
		
		МакетПечати = "ПечатьНаклеек";
		
		ДополнительныеПараметры = Новый Структура("ТолькоТовар", Элементы.Товары.ТекущиеДанные.НомерСтроки);
		
		ТДПечать = Новый ТабличныйДокумент;
		ПечатьСервер(ТДПечать, МакетПечати, ДополнительныеПараметры);
		ТДПечать.ОтображатьСетку = Ложь;
		ТДПечать.Защита = Ложь;
		ТДПечать.ТолькоПросмотр = Ложь;
		ТДПечать.ОтображатьЗаголовки = Ложь;
		ТДПечать.АвтоМасштаб = Истина;
		
		////Для наклеек свой принтер
		ТДПечать.ИмяПринтера = ПолныеПрава.ПолучитьЗначениеКонстанты("ИмяПринтераПечатьЭтикеток");
		ТДПечать.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТДПечать.ПолеСверху = 4;
		ТДПечать.ПолеСлева = 18;		
		ТДПечать.ПолеСнизу = 2;
		ТДПечать.ПолеСправа = 0;
		ТДПечать.Показать("Печать: Наклейки");
		
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен()
		И Не ТолькоПросмотр Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияКлиентПереопределяемый.ЕстьНеобработанноеСобытие() Тогда
			
				ДанныеШтрихкодов = МенеджерОборудованияКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
				
				НомерСчитанныйТовар = 0;
				ОбработатьШтрихкоды(ДанныеШтрихкодов, НомерСчитанныйТовар);
								
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры

Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов, НомерСчитанныйТовар)
	
	Элементы.Товары.ТекущаяСтрока = 0;
	
	Для Каждого стШК Из ДанныеШтрихкодов Цикл 
		//Сообщить(стШК.Штрихкод + " - "  + стШК.Количество);
		
		НоменклатураПоШК = Неопределено;
		//Найти товар по ШК и добавить в ТЧ.Товары
		Если СтрДлина(стШК.Штрихкод) > 9 Тогда
			Попытка
				НоменклатураПоШК = Справочники.Номенклатура.НайтиПоРеквизиту("IDНаСайте", Число(Сред(стШК.Штрихкод, 7, 4))); //180814123400900 			
			Исключение  			
			КонецПопытки;
		Иначе 		
			Если НоменклатураПоШК = Неопределено Тогда
				Попытка
					НоменклатураПоШК = Справочники.Номенклатура.НайтиПоКоду(стШК.Штрихкод);  			
				Исключение
					Возврат;
				КонецПопытки;		
			КонецЕсли;
		КонецЕсли;
		
		//00000000-0000-0000-0000-000000000000
			
		Если Не ЗначениеЗаполнено(НоменклатураПоШК) Тогда 
			Сообщить("Товар с кодом " + Сред(стШК.Штрихкод, 7, 4) + " не найден!");
		Иначе 
			
			мсСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НоменклатураПоШК));
			
			Если мсСтроки.Количество() = 0 Тогда   				
				
				нСтрока = Объект.Товары.Добавить();
				нСтрока.Номенклатура = НоменклатураПоШК;
				нСтрока.Количество = стШК.Количество;
				нСтрока.ЕдиницаИзмерения = нСтрока.Номенклатура.ЕдиницаИзмерения;
				
				ЦеныЗакупки = СлужебныйСервер.ЦеныЗакупки(нСтрока.Номенклатура, Объект.Поставщик, ?(Параметры.Ключ.Пустая(), Неопределено, Объект.Дата));
				ТекЦена = ЦеныЗакупки[нСтрока.Номенклатура];
				нСтрока.Цена = ?(ЗначениеЗаполнено(ТекЦена),ТекЦена,0);  
				
				Элементы.Товары.ТекущаяСтрока = нСтрока.ПолучитьИдентификатор();
				
				НомерСчитанныйТовар = нСтрока.НомерСтроки - 1;
				
			Иначе  				
				
				мсСтроки[0].Количество = мсСтроки[0].Количество + стШК.Количество;
				
				Попытка
					Элементы.Товары.ТекущаяСтрока = мсСтроки[0].ПолучитьИдентификатор();
				Исключение
				КонецПопытки;
				
				НомерСчитанныйТовар = мсСтроки[0].НомерСтроки - 1;  					
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
